{
	"persons": [
		{
			"name": "Alexandra",
			"programme": "Maskininlärning",
			"track": "Maskininlärning",
			"img": "alexandra.jpeg",
			"answers": {
				"a1": "Jag har alltid varit intresserad av maskininlärning och AI, så i början var planen att gå Data med inriktning maskininlärning. Men när det blev klart att man kunde välja att gå maskininlärningsmastern valde jag den istället, mest för att man har mer frihet i vilka kurser man tar och det fungerade bäst för mig då jag har individuell studieplan. ",
				"a2": "För mig har det berott mycket på kurserna. De kurser som redan är utvalda och obligatoriska tycker jag att jag nog hade tillräckligt med förkunskaper för, men de som jag valde själv var ibland lite för svåra och skulle nog passat bättre sista året istället för att ha en bättre grund. ",
				"a3": "Jag har inte tagit så många då jag fortfarande är på kandidaten men måste säga att introduktionskursen till AI var väldigt rolig, mest för att jag tycker ämnet är så intressant. ",
				"a4": "Jag valde Data Mining som en kurs och den var väldigt jobbig. Kände mig väldigt förvirrad kring alla koncept och kände inte att jag hade tillräckligt med kunskaper inom ämnet, relevanta ämnen runt om data mining samt bara allmän programmering till labbarna. Kan även ha varit att jag var helt ensam med folk jag aldrig ens sett förut så kände mig inte så säker i hur jag skulle kunna be om hjälp från folk. ",
				"a5": "Det kommer ta lite klippa och klistra mer ämnen, då det är väldigt fritt vad man ska ta för kurser så man kommer behöva räkna HP och liknande och man kanske inte kommer kunna ta alla kurser man skulle vilja för att 5 av dem ligger i samma period. Försök även kolla de ämnen du väljer så att har någon koll på vad kursen faktiskt kommer innehålla och gå ut på, då du har så mycket valmöjligheter av kurser. Gör inte som mig och ta kurser baserat på namnet och så visar det sig att du inte kan någonting om ämnet så allting blir jättesvårt. Och om det går, försök att ta kurser med någon du känner. Tror en av sakerna som gjorde vissa kurser svåra för mig var att jag tog den med folk jag inte kände så kunde inte ta hjälp av folk på samma sätt.",
				"a6": "Har inte kommit så långt i mitt liv. Skjuter upp det tills jag kanske hittat något bland de kurser jag bestämt mig för att ta som jag verkligen känner att det var nog det roligaste jag gjort. "
			},
			"bonus": [
				"Lyfehax?",
				"Man kan använda en äggskivare för att skiva upp champinjoner!"
			]
		},
		{
			"name": "Emma",
			"programme": "Datalogi",
			"track": "Programvaruteknik",
			"img": "emma.jpeg",
			"answers": {
				"a1": "Jag var alldeles för nyfiken på programmering för att stänga den dörren för tidigt. Sen har jag tänkt så vid varje vägval. Jag är långt ifrån den vassaste utvecklaren men det är man sällan och jag har kommit mycket längre inom det än vad jag tidigare kunnat föreställa mig. Jag känner att jag valt helt rätt (:",
				"a2": "Jag känner att jag har fått med mig det viktigaste förkunskaperna från kandidaten för att hänga med, men det krävs lite mer arbete än de som gått data från år 1. Den viktigaste kursen var, utan tvivel, Algoritmer och Komplexitet som man gick i år 3, men även andra programmeringskurser som Programmeringstekniken och Tildan.",
				"a3": "Studs har varit roligaste kursen under mastern (och åh vad jag vill babbla på om den), men eftersom den inte är bunden till datalogi-inriktningen kan jag berätta om den delade första platsen, Programvaruteknikens grunder. Det är en kurs inom mitt spår där man slumpas in i grupper om fem och sedan jobbar i ett gedigert devops-flöde med GitHub, continuous integration och testning. I slutet av kursen kan man stoltsera med att man bidragit till Open Source projekt - häftigt, jag vet! ",
				"a4": "Under första hösten på mastern gick vi kursen Artificiell Intelligens, vilket introducerar en till världen av Maskininlärning och är ett helt nytt tänk. Det var extra svårt eftersom det är relativ ny forskning som lutar sig mycket på teoretiska resonemang och matematisk notation - inte en personlig favorit. Men det är en otrolig ego boost att känna att man har det avklarat efteråt.",
				"a5": "Om du ens överväger det så skulle jag säga kör. Shoot for the stars and land on the moon. Man kommer längre än vad man hinner reflektera över.",
				"a6": "Jag vill jobba som utvecklare, gärna relaterat till forensisk datalogi eller något liknande inom datasäkerhet. Jag har alltid varit amatör-intresserad av kriminologi och eftersom många brott sker via nätet eller med hjälp av ny teknik är det sådana kompetenser som behövs. Så shoutout till Polisen eller Säpo, jag är anställningsbar om ett år (: "
			},
			"bonus": [
				"Lyfehax?",
				"Spara kikärtsspad och gör vegansk aioli av!"
			]
		},
		{
			"name": "Fanny",
			"programme": "Interaktiv Medieteknik",
			"track": "Ljud",
			"img": "fanny.jpeg",
			"answers": {
				"a1": "Jag tyckte att alla kurser lät väldigt intressanta och roliga! Ville även inrikta mig mot ljud, vilket var möjligt i denna mastern :)",
				"a2": "Ja det tycker jag absolut! Tycker framförallt att alla programmeringskurser hjälpt en mycket nu i mastern. Även om man inte älskar att programmera så ger de kunskaperna en möjligheten att faktiskt förverkliga en idé man har, vilket är viktigt när man läser mer projekt-baserade kurser (typ alla masterkurser)",
				"a3": "Läste kursen \"IT för funktionshindrade\" nu i P3 och tycker att den var både lärorik och intressant! Accessibility ju ett område som är väldigt relevant när man jobbar med IT och något som jag kan tycka saknas i vår utbildning, så den här kursen är en möjlighet att få en inblick i de verktyg och designprocesser som finns.",
				"a4": "Läser just \"Speech and Speaker Recognition\" och mycket av kursens principer och tekniker bygger på machine learning, nått som jag inte hållit på med alls innan, så det är ju en utmaning att ensam försöka förstå hur det fungerar!",
				"a5": "Kolla in vilka spår som finns och se om du hittar nått du tycker låter kul! Kolla även vilka villkorligt valfria kurser varje spår har, då man måste välja minst en sån :)",
				"a6": "Ooh svår fråga! Kanske webbutvecklare? Eller ljudprogrammerare! Har ingen aning faktiskt"
			},
			"bonus": [
				"Bästa puben utöver META?",
				"Pub som inte är i Meta? Never heard of it"
			]
		},
		{
			"name": "Felix",
			"programme": "Datalogi",
			"track": "Teoretisk datalogi",
			"img": "felix.jpeg",
			"answers": {
				"a1": "Jag tyckte att teoretisk datalogi var ett naturligt val eftersom jag alltid varit intresserad av algoritmer och verkligen gillade kurserna i algoritmer & komplexitet samt avancerade algoritmer på mastern.",
				"a2": "Mina förkunskaper var tillräckliga, men det mesta av dem fick jag från civilingenjörsprogrammet i datateknik. De viktigaste kurserna att ha med sig är algoritmer & komplexitet, diskret matematik och sannolikhetsteori. Generell färdighet inom matematik är också nyttigt.",
				"a3": "Komplexitetsteorin var roligast. Det är en väldigt specialiserad kurs som i princip bara tas av de som går teoretiska spåret, vilket gör att kursen är rätt liten och det finns större möjlighet att anpassa kursen till de ämnen deltagarna tycker är intressanta. Dessutom ges kursen av Johan Håstad, en av världens främsta experter inom ämnet, som jobbar här på KTH.",
				"a4": "Kursen i grafteori som jag tog i höstas var rolig, men väldigt utmanande. Jag hade lite för mycket att göra så jag gjorde tyvärr ett avbrott på den. Generellt för mattekurser på avancerad nivå krävs det väldigt mycket tid och att man själv sätter sig ner och löser problem samt försöker förstå bevisen för att man ska hänga med.",
				"a5": "Se till att vara väl förberedd, spåret är väldigt mattetungt. Läs på om ämnet innan så att du kan komma med relevanta frågor och försöka styra kurserna mot det du tycker är intressant inom ämnet.",
				"a6": "Jag funderar på att doktorera eller eventuellt söka jobb på något intressant företag såsom Google där man får applicera algoritmkunskaper på riktigt."
			},
			"bonus": [
				"Bästa pluggstället på campus?",
				"META såklart - alltid någon bekant man kan hänga med + gratis kaffe!"
			]
		},
		{
			"name": "Filip",
			"programme": "Interaktiv Medieteknik",
			"track": "Visuella medier",
			"img": "filip.png",
			"answers": {
				"a1": "Jag velade länge mellan datalogi och interaktiv medieteknik, men känner till slut att jag valde helt rätt med interaktiv medieteknik. Även om det kanske går att argumentera för att datalogin i stort ger en något \"bättre\" och agnostisk programmeringsgrund, så har den även många kurser som Operativssystem och så vidare, som jag är helt ointresserad av. Visserligen finns det några mindre intressanta kurser på interaktiva mastern också, men upplägget med denna master och att jag då istället cherry-picka:t de rena \"datalogikurser\" som jag varit intresserad av med mina valfria poäng, känner jag har varit helt rätt för mig.",
				"a2": "Det känner jag absolut. IPROG-kursen (interaktionprogrammering för den dynamiska webben) var en rätt intensiv kurs under kandidaten, men var ändå en av de bästa kurser jag läst. Det var den kurs som jag känner givit mig mest inför mastern och som fick mig att inse vad jag ville jobba med efter universitetstiden. Sen så är alla programmeringskurser man haft värdefulla, oavsett språk. På liknande vis är alla kurser med grupparbeten och projekt bra förberedelser. Till och med algebran var lite bra att ha med sig, detta är dock verkligen inget man behöver oroa sig för om man inte var bästa vän med matten, och faktisk tillämpning av det är bra mycket roligare än bara beräkningar för beräkningars skull.",
				"a3": "Det är faktiskt en väldigt svår fråga. IPROG var ju faktiskt innan mastern, och den kanske inte var roligast heller, även om den var väldigt lärorik. Men jag skulle nog påstå såhär:\r\n\r\nInformation Visualization - Slutprojektet är sjukt kul och lärorikt och det görs för ett företag. Sen så gör man allmänt rätt häftiga grejer. Man lägger ner mycket tid inte för att det krävs av krusen, utan för att det är kul och att man vill göra ett bra jobb... Som det alltid borde vara!\r\n\r\nGraphics and Interaction - Även om jag inte är speciellt grafikintresserad så är det sjukt kul att jobba med Unity och att tillämpa lite saker man lärt sig tidigare ordentligt.  Jag och min grupp gjorde ett väldigt coolt slutprojekt, och precis som i föregående kurs så är det upp till en själv hur avancerade projekt man vill ge sig på.\r\n\r\nAdvanced Projectcourse in Interactive Media Technology - Även här gjorde vi ett väldigt intressant projekt som blev väldigt lyckat. Man är väldigt fri att söka sig till ett projekt man själv är intresserad av.",
				"a4": "Introduktionskursen för visualisation var relativt utmanande och krävande. Den är intensiv med inlämningar varje vecka, och helt plötsligt behöver man tillämpa den där gamla matten man med nöje hade förträngt. Samtidigt så är den helt klart görbar och det svåraste är oftast de höga kraven elever sätter på sig själva :)",
				"a5": "Götta ner dig i lite basic html och css om du inte har gjort det tidigare inför inriktningen, det underlättar och gör det lättare att hänga med i de lite \"svårare\" områdena.",
				"a6": "Frontend- och webbutveckling i stort, just nu siktar jag på någon av de större konsultbyråerna. Sedan i framtiden är det mycket möjligt att jag glider in en mer fullstack-roll. Ytterligare några år fram i tiden, när man är trött på att knacka kod, så kanske det blir produktägare av något slag."
			},
			"bonus": ["Lyfehax?", "Ät gul snö, det kan vara öl."]
		},
		{
			"name": "Linnéa",
			"programme": "Interaktiv Medieteknik",
			"track": "Visuella medier",
			"img": "lelle.jpeg",
			"answers": {
				"a1": "Jag ville utforska mer i det jag fått lära mig under år tre, men på ett friare och kreativare sätt. Jag gick interaktiv medieteknik som inriktning i år 3, så det var ett naturligt val att då välja en master med samma namn. Samt att jag fick en bra förståelse av inriktningen via äldre studenter. Valet känns absolut rätt för mig. Jag har fått möjlighet att få lösa problem och komma på nya lösningar tillsammans med andra studenter där lärarna mer är acceleratorer än kunskapsbärare, vilket har fått mig att växa enormt! ",
				"a2": "Man är absolut redo att ta sig an mastern efter tre år! Hade dock önskat någon ytterligare kurs med lite tyngre JavaScript för att kunna bidra mer från början i en del kurser i år 4. Viktigaste kurserna förutom alla problemlösarkurser (matten) har för mig varit programmeringen samt de kurser där man får nosa lite på vetenskapliga arbetssätt. Vi går ju ändå på KTH, vetenskap is life.",
				"a3": "Avancerad Grafik och Interaktion. Man stod helt på egna ben och kunde skapa typ precis vad som helst tillsammans i en egenkomponerad grupp. Kreativiteten flödade och det var väldigt roligt att se resultatet av något som man jobbat MÅNGA timmar med.",
				"a4": "Haha, Avancerad Grafik och Interaktion här också.. Den är 9hp men man lägger nog ner samma tid som för minst 15hp. Detta var något jag var medveten om när jag valde att läsa kursen. Jag tänkte \"Jag kommer lära mig massa, ba göre!\", och det var verkligen så värt! Att \"lära sig att lära sig själv\" är verkligen något man gör i denna kurs.",
				"a5": "Utnyttja tiden (det går sjukt fort), var inte rädd för att testa något nytt och är något tråkigt, försök hitta något i projektet/kursen som du kan utveckla dina kunskaper inom och bli bäst på! ",
				"a6": "Jag vill jobba med att lösa problem tillsammans med andra människor. Detta då man lär sig så otroligt mycket av att arbeta med andra, och det är något jag verkligen rekommenderar att dra nytta av genom hela livet! "
			},
			"bonus": [
				"Bästa pluggstället på campus?",
				"Hyllan, Nymble, 9-14 👌🏻"
			]
		},
		{
			"name": "Martin",
			"programme": "Interaktiv Medieteknik",
			"track": "Fysisk interaktion",
			"img": "martin.jpeg",
			"answers": {
				"a1": "Jag har alltid varit intresserad av design, projektledning och interaktiva verktyg. Den här mastern passade perfekt för mig och jag har absolut valt rätt!",
				"a2": "Mina förkunskaper har i princip inte gynnat mig alls under min master. Jag har lärt mig helt nya kunskaper och öven ifall de relaterar till tidigare kurser dög informationen som gavs i masterkursen bra nog utan att kräva tidigare kunskap. Om jag måste välja en kurs som varit nyttig säger jag Reflekterande Designprocess. Det är den bästa kursen som jag läst och den gav mig en fantastisk grund för alla mina projektledningskurser som kommit sedan dess.",
				"a3": "Design som Reflekterande Praktik. Det är en desingkurs där man lär sig om soma-design (att designa med kroppen i fokus). Vi fick göra yoga, gå skogspromenader och prata om Sigmund Freud, tre saker som jag älskar.",
				"a4": "Mänsklig Perception. Den krävde massor av teknisk kunskap som föreläsaren inte förmedlade och det var ett tungt projekt med många deadlines som klaffade dåligt med andra kurser",
				"a5": "Man har stor valfrihet inom den här mastern, fråga gärna äldre studenter ifall du vill ha tips på roliga valfria kurser att läsa!",
				"a6": "Jag vill arbeta med projektledning, gärna inom design eller mediaproduktion."
			},
			"bonus": [
				"Bästa toan på campus?",
				"Handikapptoaletten i D-huset. För alla dina behov som kräver mer utrymme än en vanlig toalett. När du vill vara ostörd men inte ensam (tm)"
			]
		},
		{
			"name": "My",
			"programme": "Datalogi",
			"track": "Kognitiva system",
			"img": "my.jpg",
			"answers": {
				"a1": "Jag valde datalogi-mastern av flera anledningar! Först av allt har jag en kärlek till programmering och allra helst programmerar jag back-end. Jag gillar att skapa  funktionalitet istället för att kanske skapa något visuellt, vilket man gör mer i interaktiva mastern! Sedan tittade jag mycket på kurserna när jag skulle välja master, och tyckte helt enkelt att kurserna i datalogi-mastern verkade mer intressanta och att de skulle passa mig bättre. Jag var lite rädd i början att det skulle bli svårt, jobbigt och att jag inte skulle ha någon att labba med (de jag brukar hänga med valde inte samma master). Det är svårt, men även kul och lärorikt. Att hitta labbpartners har gått mycket bättre än jag trodde, det finns alltid någon annan som också letar efter någon. Jag känner verkligen att jag har gjort helt rätt val för mig, är supernöjd!",
				"a2": "Ja! Men jag skulle ljuga om jag säger att hösten (som är fylld av obligatoriska kurser) inte var tuff, för det var den. Det var mycket nytt och mycket tungt, men det går att klara! Nu när jag läser mer självvalda kurser är det mycket lugnare. De tre kurserna som man läser i datalogi-inriktningen i trean (Programutvecklingsteknik, Algoritmer och Komplexitet och Diskret Matematik) och Sannolikhet och Statistik är de kurser som jag har fått mest användning av det senaste året. Nu på min inriktning har även Spektrala Transformer visat sig varit nyttig!",
				"a3": "Svår fråga! Jag tror att jag tyckte om kursen Artificiell Intelligens mest som jag läste första perioden. Den består av en skrivuppgift, två labbar och en hemuppgift (eller så kunde man göra ett projekt istället hemuppgiften) och innehållsmässigt så får man ett smakprov på AI och vad det är. Jag gillade verkligen föreläsaren och även om labbarna var stundtals svåra så lärde jag mig massor, vilket alltid är kul! Det var den kursen som gjorde att jag valde spåret kognitiva system.",
				"a4": "Här hamnar nog Internets protokoll och principer och Datasäkerhet på delad första plats. Båda kursernas innehåll var nytt för mig och det var även väldigt många moment i kurserna (jag kan tycka att de borde vara värda mer än 6hp var...). ",
				"a5": "Var redo att lägga mycket tid på studierna första halvåret, det kommer vara tufft men jag tycker verkligen att det har varit värt det! Jag har verkligen känt att jag lärt mig massor det senaste året, vilket jag tycker är väldigt givande.",
				"a6": "Just nu är jag väldigt nyfiken på AI! Jag skulle kunna tänka mig att jobba i ett team som utvecklar någon sorts autonomt system, kanske en tal-assistent eller självkörande bilar. Jag tror att det kommer vara en del av vår vardag i framtiden (ännu mer än det är nu) och hur coolt vore det inte om jag skulle kunna vara med och bidra till det! "
			},
			"bonus": ["Bästa kaffet på campus?", "Sleven <3"]
		},
		{
			"name": "Karolin",
			"programme": "ICT Innovation",
			"track": "HCI and Design",
			"img": "karolin.png",
			"answers": {
				"a1": "Flera anledningar! Man får en minor inom entreprenörskap och innovation, får umgås med människor från olika kulturer, möjligheten att åka utomlands som en integrerad del av utbildningen istället för en utbytestermin, lite miljöombyte från Valhalla campuset (bara 2 kurser) och jag tyckte kurserna lät roligare jämfört med interaktiva mastern. Jag ville gå mot mer UX och kreativa kurser och mindre programmering. Därav kändes HCID-spåret lämpligare än fysisk interaktionsdesign på interaktiva mastern som jag först funderade på. Det kändes som jag skulle få mer utav min master än bara kurser helt enkelt och med facit i hand så känner jag att jag valt rätt!",
				"a2": "Ja jag känner att mina förkunskaper var tillräckliga. Jag gick interaktiv medieteknik spåret - Viktigast var nog programmerings kurserna under år 3 för att ha en grund förståelse inom programmering samt MDI men jag hade nog kunnat klara mig utan den oxå.",
				"a3": "DH2400\tPhysical Interaction Design and Realization - för att den var i en väldigt kreativ miljö och vi var som en egen liten men väldigt social klass som sågs varje dag i Middla-labbet. Den öppnade upp min bild om vad jag vill hålla på med och jag fick mer förståelse för KTH's forskning och varför det kan vara roligare projekt jämfört med arbetslivet. Innan kursen hade jag en bild om att jag bara vill hålla på med UX inom web och app-utveckling och absolut inte fysiska saker haha... Var väldigt kul att designa för bättre hälsa och rörelse genom Soma Design, det är något jag vill fortsätta utforska.",
				"a4": "Jag har valt mina kurser väl så ingen kurs jag har läst har varit särskilt svår men mest utmanande måste varit Physical Interaction Design and Realization, för att vi tilläts verkligen genomgå design processen och tusentals iterationer vilket sällan skett i mina tidigare kurser.  Ett tidskrävande, ineffektivt, frustrerande projekt men vi valde oxå att lägga ner mycket tid för att vi tyckte det var roligt och att vi umgicks på ett personligt plan.",
				"a5": "1. OBS! Prata med din studievägledare! Jag har haft en hel del överlapp i kurser från min bachelor, så för att kunna ta ut min civilingenjör har jag haft mycket kontakt med studievägledaren och fått göra min egna studieplan. Har krävt en del jobb men SÅ VÄRT DET i och med att jag fått mycket större valmöjligheter, än de flesta andra, i val av kurser - extremt glad för detta!\r\n\r\n2. Kolla upp skillnaden mellan ICT Innovation och EIT digital masterschool! Om man söker i tid till eit kan man vara utomlands båda åren på mastern om man vill och så får man dubbla examen från de universitet man studerat på. \r\n\r\n3. Kolla upp om EIT fortfarande har en Kickoff - jag var i Paris med studenter från alla partner-universiteten vilket var superkul!\r\n\r\n4. Sommarskola, vilket är lite ovanligt, antingen i Stockholm eller utomlands om du är eit student. Kan eventuellt förekomma i annan form under P1-P4 i framtiden.",
				"a6": "Jag tror starkt på design som problem lösning och vill jobba inom UX / UI / Fysisk interaktion / design / produkt utveckling / konvertering / liknande områden. "
			},
			"bonus": [
				"Favoritserie?",
				"Som jag kan komma på just nu - Euphoria!"
			]
		}
	],
	"questions": {
		"q1": "Varför valde du att läsa ditt mastersprogram? Känner du att du valt rätt?",
		"q2": "Känner du att dina förkunskaper från kandidaten var tillräckliga? Vilka kurser från kandidaten var viktigast att ha med sig i mastern?",
		"q3": "Vilken kurs har varit roligast i mastersprogrammet?",
		"q4": "Vilken kurs har varit svårast/mest utmanande?",
		"q5": "Har du några tips till dem som överväger att läsa samma mastersprogram?",
		"q6": "Vad vill du jobba med efter examen?"
	}
}
